[
    {
    "file": "experiments/week3_project1.js",
    "name": "Tree Rings version 1",
    "description": "Inspired by an original artwork by reddit user u/TheFoolVoyager (https://www.reddit.com/r/processing/comments/awzkgd/tree_rings_made_with_perlin_noise/#lightbox), aswell as a tutorial by Ahmad Moussa (https://www.gorillasun.de/blog/radial-perlin-noise-and-generative-tree-rings/). This version is a bit of an combination of the two, with the color scheme and bark layer inspired by the artwork by u/TheFoolVoyager, and the Perlin noise calculations inspired by Ahmad Moussa's tutorial."
    },
    {
    "file": "experiments/week3_project2.js",
    "name": "Tree Rings version 2",
    "description": "A second version of the tree rings artwork. For this version I wanted to experiment with motion, and while doing so I added some mouse interaction. The rings will distort and move slightly when the mouse is close to them, creating a more dynamic and interactive experience."
    },
    {
    "file": "experiments/week2_project1.js",
    "name": "Flow Fields version 1",
    "description": "Inspired by \"Lines 2\" by Tyler Hobbs (https://www.tylerxhobbs.com/works/lines-2). The original artwork has a more united and perfect circle, while my version has a bit more randomness and fluidity to it. A tutorial by Steve's Makerspace (https://www.youtube.com/watch?v=R0OFyWEglGA) was used to understand the basics of flow fields and Perlin noise."
    },
    {
    "file": "experiments/week2_project2.js",
    "name": "Flow Fields version 2",
    "description": "A second version of the flow field artwork. For this version I wanted to experiment with motion, and while doing so I also added some controls to manipulate the animation/flow field. The sliders can be used to change the angle factor, resolution and speed of the animation. The checkbox can be used to randomize the angle factor for each line, creating a more chaotic look."
    },
    {
    "file": "experiments/week1_project1.js",
    "name": "Rosace Reimagined",
    "description": "Recreation/inspiration of Vera Molnár's Computer rosace-series (1974). The version to the left is just a simple recreation, with straight lines. The version to the right has a bit more variation, with wiggly lines that randomizes every time you click on it. Additionally, there's a slider to control the rotation of the squares."
    },
    {
    "file": "experiments/week1_project2_v1.js",
    "name": "10 PRINT Recreation v1",
    "description": "Recreation of the original 10 PRINT artwork by Nick Montfort. A tutorial made by Generative Artistry was used to understand the logic behind the code. The artwork is generated by randomizing between two diagonal lines, creating a maze-like pattern."
    },
    {
    "file": "experiments/week1_project2_v2.js",
    "name": "10 PRINT Recreation v2",
    "description": "Version 2 of the 10 PRINT recreation. This version builds the artwork tile by tile, with a slight delay between each tile being drawn. This actually resembles the way the original 10 PRINT program would have generated the pattern on a Commodore 64, where the pattern would appear gradually as the program ran. This can be showcased in this video: https://www.youtube.com/watch?v=m9joBLOZVEo"
    }
]
